
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7674694918)



<pre><code>Apply complete! Resources: 3 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/f7284599-4265-4cf0-98fd-e6951aac05a3/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]
google_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "backend-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_service.backend-api-resources["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "backend-api-resources" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "secretmanager.googleapis.com"
    }

  # google_secret_manager_secret.backend-sa-secret["weather_api_key"] will be created
  + resource "google_secret_manager_secret" "backend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "weather_api_key"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Creating...
google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Creating...
google_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Creation complete after 8s [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Still creating... [10s elapsed]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Still creating... [20s elapsed]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Creation complete after 21s [id=gig-japan-398904/secretmanager.googleapis.com]
google_secret_manager_secret.backend-sa-secret["weather_api_key"]: Creating...
google_secret_manager_secret.backend-sa-secret["weather_api_key"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/weather_api_key]

Apply complete! Resources: 3 added, 1 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource "google_artifact_registry_repository" "artifact-repository" {%0A        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"%0A        name             = "ikigai"%0A        # (10 unchanged attributes hidden)%0A%0A      + docker_config {%0A          + immutable_tags = false%0A        }%0A    }%0A%0A  # google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"] will be created%0A  + resource "google_project_iam_member" "backend-sa-roles" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com"%0A      + project = "gig-japan-398904"%0A      + role    = "roles/secretmanager.secretAccessor"%0A    }%0A%0A  # google_project_service.backend-api-resources["secretmanager.googleapis.com"] will be created%0A  + resource "google_project_service" "backend-api-resources" {%0A      + disable_on_destroy = true%0A      + id                 = (known after apply)%0A      + project            = "gig-japan-398904"%0A      + service            = "secretmanager.googleapis.com"%0A    }%0A%0A  # google_secret_manager_secret.backend-sa-secret["weather_api_key"] will be created%0A  + resource "google_secret_manager_secret" "backend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "weather_api_key"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0APlan: 3 to add, 1 to change, 0 to destroy.%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Creating...%0Agoogle_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Creation complete after 8s [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Still creating... [10s elapsed]%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Still creating... [20s elapsed]%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Creation complete after 21s [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_secret_manager_secret.backend-sa-secret["weather_api_key"]: Creating...%0Agoogle_secret_manager_secret.backend-sa-secret["weather_api_key"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/weather_api_key]%0A%0AApply complete! Resources: 3 added, 1 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":26,"Program":"tfcmt","SHA1":"1e563e89c9a3da780ed6ebb2629f12ff5052613a","Vars":{},"WorkflowName":"iaac_apply"} -->